lcrochaDEV/esp32_dasai_mochi_clone_and_how_to/hinhdongesp32/WifiConnect.cpp
#if defined(ESP8266)
  #include <ESP8266WiFi.h>
#elif defined(ESP32)
  #include <WiFi.h>
#endif

#include "WifiConnect.h"

// Variável para contar as tentativas
  int maxTentativas = 10;
  int tentativaAtual = 0;

WifiConnect::WifiConnect(const char* ssid, const char* password, Animations* animationPtr){
  this->ssid = ssid;
  this->password = password;
  // Salva a referência do objeto Animations
  this->wifiAnimationRef = animationPtr;
}


void WifiConnect::connectionsMethod(){
  //Serial.begin(115200);
  Serial.printf("Conectando a %s ", this->ssid);
  WiFi.begin(this->ssid, this->password); // Inicia a conexão

  while (WiFi.status() != WL_CONNECTED) { // Aguarda a conexão ser estabelecida
    delay(500);
    Serial.print(".");
    if(tentativaAtual == maxTentativas){
      this->wifiAnimationRef->not_wifi();
      Serial.println("\nFalha ao conectar Wifi!");
      Serial.print("\nConectando");
    }
    tentativaAtual++; // Incrementa o contador
  }

  if(WiFi.status() == WL_CONNECTED){
    Serial.println("\nConectado ao Wi-Fi!");
    Serial.print("Endereco IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("Endereco MAC do Gateway: ");
    Serial.println(WiFi.macAddress()); // Anote este MAC para usar no codigo do Sender
    Serial.print("Canal Wi-Fi atual: ");
    Serial.println(WiFi.channel()); // Todos os senders devem usar este canal
  }
}


bool WifiConnect::connect_status(){
    if (WiFi.status() == WL_CONNECTED) {
      //Serial.println("\nWifi Conectado!");
        return true; // Retorna TRUE, indicando sucesso.

    } else {
        return false; // Retorna FALSE, indicando falha.
  }
}